{
    "content": [
        "First Page",
        "1- Your journey to mastering Spanish starts here!\nBook your free trial session",
        "2- Why learn with Spanish with Seif?\nA logical method\nMake rapid progress and gain efficiency with our approach based on logic and practice: no more old-school grammar!",
        "Join interactive online classes\nExperience Spanish from day one, in a group or privately.",
        "Progress to higher levels\nA smooth progression: understand, practice, master.",
        "3- Master Spanish. Progress without limits.\nChoose the type of learning that fits your needs",
        "Group classes: Learn Spanish step by step with dynamic and practical classes. Speak up and enjoy the energy of a small and motivated group (6 to 10 students max).",
        "Private classes: A teacher just for you. Learn Spanish at your own pace, with personalized support that helps you progress quickly and confidently.",
        "Spanish for kids and teens: Introduce your child to Spanish gradually with fun, clear classes adapted to their pace. They’ll learn while having fun and gain confidence.",
        "4. Spanish with Seif is, above all, a team!\nSpanish with Seif is all about a team of passionate teachers!",
        "Seif\n¡Hola! I’m Seif, a passionate Spanish teacher and founder of Spanish with Seif. My mission is to help you speak Spanish confidently and with joy, wherever you are. With my experience teaching students from different countries and a clear, interactive, and results-oriented method, I help you speak Spanish with confidence and progress quickly toward your goal.",
        "Katret Nada\n¡Hola! I’m Katret Nada, a Spanish teacher at the University of Algiers 2. With seven years of experience, I help my students speak confidently through personalized, engaging classes rooted in Hispanic culture. Learning Spanish here is more than just a language; it’s a real experience.",
        "Feriel\n¡Hola! I’m Feriel, a Spanish teacher. I work with both individuals and businesses to help them learn Spanish in a dynamic, interactive, and friendly environment. My classes focus on conversation, confidence, and, above all, the joy of learning.",
        "5. Testimonials\nThank you, Seif, for this enriching course. Personally, I learned a lot, and it helped me a lot during my trip when I had no idea about the Spanish language.\n— Rym G.",
        "Hola Seif, I want to express my deepest gratitude for all the support and dedication you showed during our online classes. Thanks to your teaching, I acquired new knowledge. Thank you for your patience and for the effort you put in, making this process not only instructive but also very enjoyable 🙏❤️.\n— Houda A.",
        "Group Classes",
        "Learn Spanish in a dynamic atmosphere\nOnline classes in small groups, accessible, interactive, and designed to get you speaking from the very first sessions.",
        "Check the levels\nSign up now",
        "Why choose our group classes?",
        "1- Small groups\nJoin a small group of 6 to 10 people to speak, practice, ask questions, and progress together.\nFewer people = more speaking time for you!",
        "2- A straight-to-the-point method\nForget endless theoretical Spanish classes. With a clear, logical, and practice-focused approach, you’ll speak from the first session and progress every step of the way.",
        "3- All materials included\nYou receive all necessary materials: digital textbooks, audio files, extra exercises, and resources tailored to your level.",
        "4- A clear, structured, and effective program\nEach level is divided into sub-levels of 3 months (24 sessions of 2 hours = 48 hours, practical classes, plus final exam). The program follows the standards of the Common European Framework of Reference for Languages (CEFR), recognized worldwide.",
        "5- A real evaluation and a certificate\nAt the end of the session, you take a test to validate your progress and receive a level certificate. Perfect for your CV or academic record.",
        "6- Satisfaction guaranteed or your money back\nTry without risk! If you’re not convinced after the first class, you can request a refund within 24 hours. No questions asked.",
        "Testimonial\n\"I would like to take this opportunity to thank Seif for this enriching Spanish course. I really enjoyed the friendly atmosphere and the valuable learning. I can’t wait to start the next session and keep progressing with all of you. Thanks to the group too 😄\"\n— Kahina T.",
        "Available Sessions\nChoose your group",
        "A1.1 – Beginner\n19 200 DZD / 48 hours (400 DZD/hour)\n160 USD / 48 hours ($3.3/hour)",
        "✓ 24 sessions (4h/week)\n✓ 6 to 10 people max\n✓ Enjoy the group dynamic\nTwo available time slots:\n✓ Monday & Wednesday from 7:30 PM to 9:30 PM\n✓ Sunday & Tuesday from 7:30 PM to 9:30 PM",
        "A2.1 – Beginner\n19 200 DZD / 48 hours (400 DZD/hour)\n160 USD / 48 hours ($3.3/hour)",
        "✓ 24 sessions (4h/week)\n✓ 6 to 10 people max\n✓ Enjoy the group dynamic\nOne available time slot:\n✓ Sunday & Wednesday from 7:30 PM to 9:30 PM",
        "B2.1 – Upper Intermediate\n19 200 DZD / 48 hours (400 DZD/hour)\n160 USD / 48 hours ($3.3/hour)",
        "✓ 24 sessions (4h/week)\n✓ 6 to 10 people max\n✓ Enjoy the group dynamic\nOne available time slot:\n✓ Monday & Thursday from 7:30 PM to 9:30 PM",
        "Here’s a concise description of language levels A1, A2, B1, and B2 according to the CEFR (Common European Framework of Reference for Languages):",
        "A1 – Beginner\nYour first steps in the Spanish world\n• Understand simple phrases and expressions on familiar topics.\n• Introduce yourself and ask simple questions.\n• Write short and simple sentences to give personal information.\nTwo sub-levels: A1.1, A1.2",
        "A2 – Beginner\nStrengthen your foundations\n• Understand simple phrases in everyday situations.\n• Communicate in familiar situations using simple sentences.\n• Write simple messages and letters with basic details.\nThree sub-levels: A2.1, A2.2, A2.3",
        "B1 – Intermediate\nMaster everyday conversations\n• Understand the main points of a conversation on familiar or professional topics.\n• Take part in a discussion on various subjects and give your opinion.\n• Write clear texts on familiar topics, developing ideas.\nFour sub-levels: B1.1, B1.2, B1.3, B1.4",
        "B2 – Upper Intermediate\nNavigate complex topics\n• Understand more complex texts and discussions on abstract or specialized topics.\n• Express yourself fluently and spontaneously. Actively participate in discussions.\n• Write detailed, well-structured texts and present ideas precisely.\nFour sub-levels: B2.1, B2.2, B2.3, B2.4",
        "Each sub-level lasts two months (48 hours of classes over 24 two-hour sessions).",
        "Don’t know your level yet? Book a free placement test here.",
        "FAQ",
        "1. General information about the classes:",
        "Be on time: connect 5 minutes before the start of the class.",
        "Check your internet connection before each class to avoid interruptions.",
        "Mute your microphone when you’re not speaking to avoid background noise.",
        "Prepare your materials: notebook, pen, and preferably headphones.",
        "Choose a quiet place to avoid interruptions during class.",
        "Respect other participants: active listening and take turns speaking.",
        "Participate actively: ask questions and engage in the activities.",
        "Do not record the class without the teacher’s permission.",
        "Notify us in advance if you will be absent to receive the summary or material.\nWe give 100%... and expect the same energy from you! 😍",
        "2. How are the classes conducted?",
        "The classes are 100% online via Zoom, interactive, with conversation activities and practical exercises.",
        "3. What level of Spanish is required to start?",
        "Our courses are open to all levels. A placement test will be conducted to place you in the right group.",
        "4. How do I access the classes?",
        "After registration, you will receive a Zoom link to join the class for each session.",
        "5. How many people per group?",
        "From 6 to 10 participants maximum, to ensure good interaction and personalized follow-up.",
        "6. How long is each class?",
        "Each class lasts 2 hours.",
        "7. Can I connect from any device?",
        "Yes, you can attend classes from a computer, tablet or smartphone.",
        "8. How do I move to the next level? Is there an exam?",
        "Yes, regular assessments are conducted to validate your progress before moving on to the next level.",
        "9. How can I pay for my registration?",
        "Choose the method that suits you best: CCP, bank transfer, Visa or Mastercard. Once the payment is confirmed, you will join your group and receive your access link before each class.\nIf you cannot pay using these methods, email us at spanishwithseif@gmail.com and we will assist you.",
        "10. Can I get a refund if I change my mind?",
        "Yes, you can request a refund within 24 hours after your first class.",
        "Private Classes",
        "Tailor-made classes, adapted to your pace and goals\nPlan your private classes according to your schedule.",
        "✓ You decide the schedule and the number of classes per week.\n✓ Learn whenever you want.\n✓ Follow a structured or personalized program according to your goals.\n✓ Invite a friend or family member to join you at no extra cost!",
        "Choose the plan that suits your goals and ideal pace\nOne or two students",
        "10-hour package",
        "25 000 DZD (2500 DZD/hour)\n200 USD ($20/hour)\nIdeal for short-term goals or occasional reviews.\n✓ Enjoy 10 classes with a dedicated Spanish teacher.\n✓ Schedule your classes whenever you want.\n✓ Valid for 2 months.",
        "20-hour package",
        "40 000 DZD (2000 DZD/hour)\n340 USD ($17/hour)\nPerfect if you want to start learning at a regular pace.\n✓ Enjoy 20 classes with a dedicated Spanish teacher.\n✓ Schedule your classes whenever you want.\n✓ Valid for 3 months.",
        "30-hour package",
        "51 000 DZD (1700 DZD/hour)\n450 USD ($15/hour)\nThe most popular choice. Perfect if you want to accelerate your learning at a steady pace.\n✓ Enjoy 30 classes with a dedicated Spanish teacher.\n✓ Schedule your classes whenever you want.\n✓ Valid for 4 months.",
        "Book your free trial class here.",
        "FAQ – Private Classes",
        "1. Who are private classes for?\nFor anyone who wants 100% personalized learning, regardless of their level.",
        "2. How are the classes conducted?\nVia Zoom, with flexible schedules and content tailored to your goals.",
        "3. How long is a class?\nThe standard duration is 1 hour, but it can be adjusted (30 min, 1h30, etc.) according to your needs and availability.",
        "4. How are the classes conducted?\nThe classes are 100% online via Zoom, interactive, with conversation activities and practical exercises.",
        "5. What are the advantages compared to group classes?\nA tailor-made program, more interaction, a pace adapted to your progress. Plus, flexible schedules that fit your availability.",
        "6. Can I choose my teacher?\nYes, you can express a preference. Otherwise, we will assign you a teacher that best suits your needs.",
        "7. How can I pay?\nChoose the method that suits you best: CCP, bank transfer, Visa, or Mastercard. Once confirmed, you can start immediately with your teacher, depending on availability. If you cannot pay using these methods, email us at spanishwithseif@gmail.com and we will assist you.",
        "8. Can I cancel or reschedule a class?\nYes, provided you give at least 12 hours’ notice to avoid losing the session. In case of an emergency (health issue, urgent incident), inform us as soon as possible and we will find a suitable solution.",
        "9. Can two people (couple, friends) take private classes together?\nYes, it’s possible and at no extra cost. The class will be for both people at the same time, not separate.",
        "Book a Trial Class",
        "Your first Spanish class\n30 min – Live on Zoom\nCurious about learning Spanish but don’t know where to start? Try a free 30-minute individual class.",
        "Schedule a trial class",
        "How does it work?\n✓ Reserve your spot. Choose the time that works for you.\n✓ Receive a Zoom link sent to your WhatsApp or email a few minutes before the class starts.\n✓ Join your session (you might need a notebook!).\n✓ Decide at your convenience—no pressure to continue.\nChanged your plans? Don’t worry. You can reschedule or cancel your class, just let us know in advance 😊.",
        "Schedule a trial class",
        "Spanish Classes for Kids & Teens",
        "Learning Spanish becomes child’s play! Give your child the opportunity to learn Spanish in a fun and effective way, while having fun.",
        "Our online classes for kids and teens (8–17 years old) combine games, interactive activities, and simple conversations to develop confidence and the joy of learning. With experienced and caring teachers, your child progresses effortlessly, discovering the language with curiosity and excitement.",
        "Why choose our classes?\n✔ Fun and interactive learning: games, songs, visual and practical activities.\n✔ Age-appropriate and paced learning: designed for ages 6–17.\n✔ Qualified and caring teachers: a motivating and safe environment.\n✔ Flexible schedules and 100% online\n✔ Regular feedback to track progress\nAn investment in their future, in a fun and motivating environment!",
        "Book a trial class",
        "Rates",
        "10-hour package\n25 000 DZD (2500 DZD/hour)\n200 USD ($20/hour)\n✓ Ideal pace: one class per week.\n✓ Valid for 2 months.",
        "20-hour package\n40 000 DZD (2000 DZD/hour)\n340 USD ($17/hour)\n✓ Perfect for one or two classes per week, ideal for a full term.\n✓ Valid for 2 months.",
        "30-hour package\n51 000 DZD (1700 DZD/hour)\n450 USD ($15/hour)\nPerfect for regular follow-up during a school semester.\n✓ Valid for 6 months.",
        "FAQ – Spanish Classes for Kids & Teens",
        "1. From what age can my child join your classes?\nOur classes are open from 8 years old, with programs adapted to each age group (children and teens).",
        "2. How are the classes conducted?\nThey are online with a teacher experienced in teaching young learners. The classes are short, interactive, and fun to keep their attention.",
        "3. How long is a session?\nOn average, a session lasts 60 minutes for children and teens, respecting their concentration capacity.",
        "4. Does my child need prior knowledge of Spanish?\nNot necessarily. We offer classes for all levels, including complete beginners.",
        "5. What is required to join the classes?\nA computer or tablet, a stable internet connection, and a microphone/camera for active participation.",
        "6. Can parents attend the class?\nYes, especially for younger children, to support them and ensure everything goes smoothly.",
        "7. Will my child be assessed? Is there a diploma?\nYes, but in a fun and age-appropriate way! The evaluations are only to measure progress and keep motivation high, never to stress the child. At the end of the course, they will receive a small certificate of encouragement to celebrate their effort and make them want to continue learning. It’s not a grade, but a motivating recognition of their progress.",
        "8. What are the payment options?\nYou can pay via CCP, bank transfer, Visa/Mastercard. If you cannot pay using these methods, email us at spanishwithseif@gmail.com and we will assist you."
    ]
}